export const about = {
  intro: [
    "안녕하세요! 새로운 것에 도전하기 좋아하는 개발자입니다.",
    "문제를 해결하는데 흥미를 느끼고, 성장을 지향합니다.",
  ],
  detail: [
    "지속적인 학습을 통해 보유기술을 확장하고, 문제 해결을 통해 성장하는 개발자입니다.",
    `티맥스오피스에서 ToHangul(ToOffice), SuperOffice등의 다양한 기능을 구현하고,
    보다 나은 성능을 위한 구조 개선, 개발 환경 개선을 위해 노력했습니다.`,
    `문제 해결에서의 흥미와 향상심을 동기로 자발적으로 업무 시간 외에도 시간을 투자하고 노력했고, 
    여유 있으면 담당 업무 외에도 문제 해결을 통해 오피스 전반적인 구조를 파악할 수 있었습니다.`,
    "저의 강점은 아래와 같습니다.",
  ],
  pros: [
    `레거시 스파게티 코드 다루기: 매우 크고 복잡하며, 인수인계도 잘 되지 않은 코드를
    분석해 기존 코드를 바탕으로 기능 개발, 문제 해결, 구조 개선 등을 주 업무로 오래 다뤘습니다.
    hwp 문서 편집기에서는 머리말꼬리말, 구역, 다단 등 복잡한 레이아웃 관련 기능 등을 개발 및 개선했고,
    문서 편집기 공통 구조도 오래 담당하였으며, 액스에서는 프리랜서를 포함한 6명 이상의 개발자들이
    각자의 스타일로 만든 코드를 바탕으로 기능 개발, 구조 개선 등의 업무를 수행했습니다.
    `,
    `동료들과의 협업: 큰 회사에서의 QA, UX, 다른 개발 팀원들과의 협업을 경험했고, 작은 스타트업에서
    PM, 디자이너, 개발자 팀원과의 협업도 경험해봤습니다. 특히 웹오피스 공통팀에서는 다른 개발팀원과의
    협업이 매우 많아서 구조 변경 및 개선을 위한 의견 조율 경험이 매우 많고, 스타트업에서는 시간에 쫓기는
    개발 경험을 통해 소단위 프로젝트의 일정 조율 등을 경험했습니다.
    협업에 정답은 없지만, 많은 경험을 통해 본인의 역량을 파악하고, 의견을 나누는 스킬이 향상되었습니다.
    `,
    `문제 해결 능력: 공통 구조의 문제 해결을 위한 구조 개선 등 복잡한 문제 해결 경험 다수,
    제품 안정화를 위한 이슈 해결 경험 다수 있습니다. 액스에서는 3개월의 짧은 기간 동안 백로그 포함 180개의 이슈 중
    78%인 약 140개의 이슈를 처리하였습니다. 일단 문제를 빠르게 처리하고, 본질적인 문제 해결이
    필요한 경우에는 협업을 통해 구조 개선 등을 진행할 수 있습니다. 웹오피스의 CI/CD 담당 경험을 통해
    주변에 경험자가 없는 문제에 대해 스스로 해결하는 경험도 다수 있습니다.
    `,
  ],
  email: "nuclearbomb6518@gmail.com",
  linkedin: "https://www.linkedin.com/in/준섭-신-24b5a8247/",
  github: "https://github.com/Junseop-Shin/",
  resume: "../src/assets/resume.pdf",
};
